Revit 2027 API
ElectricalSystem.ApparentCurrentPhaseA Property
 The ApparentCurrentPhaseA value of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ApparentCurrentPhaseA { get; }
Public ReadOnly Property ApparentCurrentPhaseA As Double
	Get
public:
property double ApparentCurrentPhaseA {
	double get ();
}
member ApparentCurrentPhaseA : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  This property only available when System Type is Power!
Remarks
 This property is used to retrieve the ApparentCurrentPhaseA value of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace